# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names.drop(baby_names.columns[0], axis=1 , inplace=True)
baby_names

              Id     Name  Year Gender State  Count
0          11350     Emma  2004      F    AK     62
1          11351  Madison  2004      F    AK     48
2          11352   Hannah  2004      F    AK     46
3          11353    Grace  2004      F    AK     44
4          11354    Emily  2004      F    AK     41
...          ...      ...   ...    ...   ...    ...
1016390  5647422     Seth  2014      M    WY      5
1016391  5647423  Spencer  2014      M    WY      5
1016392  5647424     Tyce  2014      M    WY      5
1016393  5647425   Victor  2014      M    WY      5
1016394  5647426   Waylon  2014      M    WY      5

[1016395 rows x 6 columns]

### Step 6. Is there more male or female names in the dataset?

In [6]:
gender_counts = baby_names['Gender'].value_counts()
gender_counts

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [8]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [9]:
baby_names['Name'].value_counts().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [10]:
name_values = baby_names['Name'].value_counts()
least_name_count = name_values.min()
(name_values == least_name_count).sum()

3682

### Step 11. What is the median name occurrence?

In [11]:
baby_names['Name'].value_counts().median()

8.0

### Step 12. What is the standard deviation of names?

In [12]:
baby_names['Name'].value_counts().std()

122.02996350814088

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [13]:
baby_names.describe().loc[['mean', 'min', 'max', 'std']]

                Id         Year        Count
mean  2.830991e+06  2009.053190    34.850124
min   1.135000e+04  2004.000000     5.000000
max   5.647426e+06  2014.000000  4167.000000
std   1.652476e+06     3.138293    97.397346